Repository: Snsaiu/TabbyCat_OpenSource
Catalog: TabbyCat.Shared/Languages/AppResources.*.resx
Languages: fr_fr, ja_jp, ko_kr, zh_hans

source: Architect Guide for Programmers
fr_fr: Guide d'architecture pour programmeurs
ja_jp: プログラマーアーキテクチャガイド
ko_kr: 프로그래머 아키텍처 가이드
zh_hans: 程序员架构指南

source: Children's Book Creator
fr_fr: Créateur de livres pour enfants
ja_jp: 児童書クリエーター
ko_kr: 어린이 책 창작자
zh_hans: 儿童书籍创作者

source: Tech-Challenged Customer
fr_fr: Défi technique client
ja_jp: 技術チャレンジクライアント
ko_kr: 기술 도전 고객
zh_hans: 技术挑战客户

source: Creative Branding Strategist
fr_fr: Stratège de marque créative
ja_jp: クリエイティブブランドストラテジスト
ko_kr: 창의적 브랜드 전략가
zh_hans: 创意品牌策略师

source: Book Summarizer
fr_fr: Générateur de résumés de livres
ja_jp: 書籍要約ジェネレーター
ko_kr: 책 요약 생성기
zh_hans: 书籍摘要生成器

source: study planner
fr_fr: Planificateur d'apprentissage
ja_jp: 学習計画作成者
ko_kr: 학습 계획 작성자
zh_hans: 学习计划制定者

source: SEO specialist
fr_fr: Expert en SEO
ja_jp: SEO専門家
ko_kr: SEO 전문가
zh_hans: SEO专家

source: nutritionist
fr_fr: Nutritionniste
ja_jp: 栄養士
ko_kr: 영양사
zh_hans: 营养师

source: Yes or No answer
fr_fr: Réponses oui ou non
ja_jp: はい/いいえの回答
ko_kr: 예 아니오 대답
zh_hans: 是或否的回答

source: Healing Grandma
fr_fr: Grand-mère apaisante
ja_jp: 癒し系おばあちゃん
ko_kr: 치유 할머니
zh_hans: 治愈系奶奶

source: Rephraser with Obfuscation
fr_fr: Réécrivain avec fonction de confusion
ja_jp: 混乱機能付きリライター
ko_kr: 혼란 기능이 있는 리라이터
zh_hans: 带有混淆功能的改写器

source: Large Language Models Security Specialist
fr_fr: Expert en sécurité des grands modèles de langage
ja_jp: 大規模言語モデル安全専門家
ko_kr: 대형 언어 모델 보안 전문가
zh_hans: 大语言模型安全专家

source: Tech Troubleshooter
fr_fr: Dépanneur technique
ja_jp: 技術トラブルシューティング者
ko_kr: 기술 문제 해결자
zh_hans: 技术故障排除者

source: Ayurveda Food Tester
fr_fr: Testeur de nourriture ayurvédique
ja_jp: アーユルヴェーダ食品テスター
ko_kr: 아유르베다 음식 테스터
zh_hans: 阿育吠陀食品测试员

source: Music Video Designer
fr_fr: Concepteur de vidéos musicales
ja_jp: ミュージックビデオデザイナー
ko_kr: 뮤직 비디오 디자이너
zh_hans: 音乐视频设计师

source: Common
fr_fr: Commun
ja_jp: きょうつう
ko_kr: 공통
zh_hans: 通用

# DeleteSessionSaveChatRecordTip
source: If you keep the chat history, the favorited content will continue to be available unless it is unfavorited.
zh_hans: 如果保留聊天记录，那么被收藏的内容将可以继续使用，除非被取消收藏

# DeleteSessionSaveChatRecord
source: Save chat history when deleting conversation
zh_hans: 删除会话时保存聊天记录

source: Portfolio
zh_hans: 作品集

# RunningTaskCount
source: Number of tasks running:
zh_hans: 正在运行的任务数量：

# OpenImage
source: Open the image
zh_hans: 打开图片

source: Download
zh_hans: 下载

source: Delete
zh_hans: 删除

source: Session
zh_hans: 会话

source: Rename
zh_hans: 重命名

source: Character Setting
zh_hans: 角色设置

source: Choose Character
zh_hans: 选择角色

source: Name
zh_hans: 名称

source: Character Name
zh_hans: 角色名称

source: Description
zh_hans: 描述

source: Set as Default
zh_hans: 设置为默认

source: Add
zh_hans: 新增

source: Model Setting
zh_hans: 模型设置

source: Model
zh_hans: 模型

# DefaultMarkdown
source: Try markdown by default
zh_hans: 聊天默认使用Markdown

# HotkeyToStartProgram
source: Try hotkey (Ctrl+Space) wakeup program
zh_hans: 使用（Ctrl+Space）热键唤醒程序

source: Close button behavior
zh_hans: 关闭按钮行为

source: Close Program
zh_hans: 关闭程序

# AskEverytime
source: Every time you ask
zh_hans: 每次询问

# TopMost
source: Always show on top (need restart)
zh_hans: 总在顶端显示(需要重启)

source: Save
zh_hans: 保存

source: Favourite
zh_hans: 收藏

source: Use markdown
zh_hans: 使用markdown

source: Choose Image
zh_hans: 选择图片

source: Api key
zh_hans: Api密钥

source: Api domain
zh_hans: Api域名

source: Refresh
zh_hans: 刷新

source: Rigorous and imaginative
zh_hans: 严谨与想象

source: Context has an upper limit
zh_hans: 上下文有上限

source: Maximum number of context messages
zh_hans: 上下文消息数量上限

source: End point
zh_hans: 终结点

# ModelDeplayName
source: Model deployment name
zh_hans: 模型部署名称

source: Api path
zh_hans: Api路径

source: Perform
zh_hans: 执行

source: Fold
zh_hans: 折叠

source: Expand
zh_hans: 折叠

source: Chat
zh_hans: 聊天

source: Character
zh_hans: 聊天角色

source: New Session
zh_hans: 新建会话

source: Open Favorites
zh_hans: 打开收藏夹

source: Chat Setting
zh_hans: 聊天设置

source: Send
zh_hans: 发送

# TextToImagePromptDescription
source: Positive prompt words are used to describe the elements and visual features expected to be included in the generated image. Supports Chinese and English, with a length of no more than 800 characters. Each Chinese character/letter occupies one character, and the excess will be automatically truncated. Example value: A sitting orange cat with a happy expression, lively and cute, realistic and accurate.
zh_hans: 正向提示词，用来描述生成图像中期望包含的元素和视觉特点。 支持中英文，长度不超过800个字符，每个汉字/字母占一个字符，超过部分会自动截断。 示例值：一只坐着的橘黄色的猫，表情愉悦，活泼可爱，逼真准确。

source: Image Scale
zh_hans: 图片比例

source: Show
zh_hans: 显示

source: Experimental Features
zh_hans: 实验性功能

source: General
zh_hans: 通用

source: Miscellaneous
zh_hans: 杂项

source: Model Provider
zh_hans: 模型提供方

source: Take effect after restart
zh_hans: 重启后生效

# CustomModelMustHaveName
source: A custom model must have a name
zh_hans: 自定义模型必须要有名称

source: Saved successfully
zh_hans: 保存成功

source: Save failed
zh_hans: 保存失败

# ConfirmDelete
source: Do you want to delete {0} ?
zh_hans: 确定要删除 {0} 吗？

# DeleteSuccess
source: Deleted successfully
zh_hans: 删除成功

source: Delete failed
zh_hans: 删除失败

source: Character name cannot be empty
zh_hans: 角色名称不能为空

source: Character description cannot be empty
zh_hans: 角色描述不能为空

source: Character name already exists
zh_hans: 角色名称已存在

source: Added successfully
zh_hans: 添加成功

source: Add failed
zh_hans: 添加失败

source: Cannot enter empty content
zh_hans: 不能输入空内容

source: Renamed successfully
zh_hans: 重命名成功

source: Rename failed
zh_hans: 重命名失败

# ConfirmDeleteSelectedSession
source: Are you sure you want to delete the selected session?
zh_hans: 确定要删除选择的会话吗？

source: Save path cannot be empty
zh_hans: 保存路径不能为空

source: Updated successfully
zh_hans: 更新成功

source: Update failed
zh_hans: 更新失败

# SelectFolder
source: Select a folder
zh_hans: 选择文件夹

source: Open folder
zh_hans: 打开文件夹

source: No items selected for export
zh_hans: 未选择任何可以导出的项目

source: Exported successfully
zh_hans: 导出成功

# ConfirmDeleteItem
source: Are you sure you want to delete?
zh_hans: 确定要删除吗？

source: Entity not found
zh_hans: 未找到实体

# RequestFileDownloadFailed
source: Failed to request file download {0}
zh_hans: 请求下载文件失败：{0}

# FailedToObtainDownloadFileLink
source: Failed to obtain download file link:{0}
zh_hans: 获得下载文件链接失败：{0}

# AddRunningHubApiKeyInSettings
source: Please add the RunningHub API key in the settings
zh_hans: 请在设置中添加RunningHub的Apikey

source: Executed successfully
zh_hans: 执行成功

# AnErrorOccurred
source: An error occurred:{0}
zh_hans: 发生错误：{0}

# PleaseSelectAIModelFirst
source: Please select an AI model first
zh_hans: 请先选择一个AI模型

source: No session selected
zh_hans: 未选择会话

source: Failed to update session
zh_hans: 更新会话失败

# PleaseSelectImageFirst
source: Please select an image first
zh_hans: 请先选择图片

source: Failed to upload image
zh_hans: 上传图片失败

source: Cut out image
zh_hans: 抠图

source: Text to image
zh_hans: 文生图

source: Agent
zh_hans: 智能体

source: Message
zh_hans: 消息

source: Minimize
zh_hans: 最小化

# DoYouWantToRelogin
source: The account needs to be logged in again. Are you sure you want to log in again?
zh_hans: 账号需要重新登录，确定要重新登录吗？

source: Sign out
zh_hans: 登出

source: Logout failed
zh_hans: 登出失败

# AppWillClose
source: The software will be shut down soon!
zh_hans: 软件即将关闭！

source: Login failed
zh_hans: 登录失败

# LoginUseAi
source: Log in to use Ai Chat for free
zh_hans: 登录后免费使用Ai聊天

source: Mine
zh_hans: 我的

source: Cancel
zh_hans: 取消

source: Ok
zh_hans: 确定

# LoginErrorTryAgain
source: Login failed, please try again!
zh_hans: 登录失败,请重试！

# LoginErrorEmailNullTryAagin
source: Login failed, failed to obtain email address, please try again!
zh_hans: 登录失败,获得邮箱失败，请重试！

# SaveDefaultSessionError
source: Failed to save default session!
zh_hans: 保存默认会话失败！

# UnknownErrorSendErrorTryAgain
source: Unknown error, sending failed, please try again!
zh_hans: 未知错误,发送失败,请重试！

# NotSupport
source: {0} is not supported.
zh_hans: {0}不受支持。

# UnableConstructObject
source: Unable to construct {0} object
zh_hans: 无法构建{0}对象

source: Save Chat Session Error.
zh_hans: 保存聊天会话失败。

# MustLoginToUseTabbyCatAi
source: You must log in to use the TabbyCatAi model
zh_hans: 使用TabbyCatAi模型必须先登录

source: Background image settings
zh_hans: 背景图设置

source: Disable
zh_hans: 禁用

source: Default background
zh_hans: 默认背景

source: Custom background
zh_hans: 自定义背景

source: Opacity
zh_hans: 不透明度

# SelectBackgroundImage
source: Select a background image
zh_hans: 选择背景图片

# ImageCount
source: Number of pictures
zh_hans: 图片数量

# TextToImageNegativePromptDescription
source: Reverse prompt words are used to describe content that you do not want to see in the screen, and can limit the screen. Supports Chinese and English, and the length does not exceed 500 characters. The excess will be automatically truncated. Example values: low resolution, error, worst quality, low quality, incomplete, extra fingers, poor proportions, etc.
zh_hans: 反向提示词，用来描述不希望在画面中看到的内容，可以对画面进行限制。 支持中英文，长度不超过500个字符，超过部分会自动截断。 示例值：低分辨率、错误、最差质量、低质量、残缺、多余的手指、比例不良等。

source: Image Processing
zh_hans: 图片处理

source: Video Processing
zh_hans: 视频处理

source: Text To Video
zh_hans: 文本生成视频

source: Image To Video
zh_hans: 图片生成视频

# TextToVideoPromptDescription
source: Try to input the picture in your mind and describe it as clearly as possible. You can try to use some style modifiers to assist your expression.
zh_hans: 尝试输入你心中的画面，尽量的描述清楚，可以尝试使用一些风格修饰词辅助你的表达。

source: Video size
zh_hans: 视频尺寸

source: Global Stylization
zh_hans: 全局风格化

source: Local stylization
zh_hans: 局部风格化

source: CommandsEdit
zh_hans: 指令编辑

source: Partial repaint
zh_hans: 局部重绘

source: Remove watermark
zh_hans: 去水印

source: Expand image
zh_hans: 扩图

source: Image super-resolution
zh_hans: 图像超分

source: Image colorization
zh_hans: 图像上色

source: Line drawing
zh_hans: 线稿生图

source: Mat map
zh_hans: 垫图

source: File upload error!
zh_hans: 文件上传失败！

# CommandEditImagePromptDescription
source: Usage scenario: Personal appearance, such as adding accessories (such as wearing sunglasses/earrings), changing hair color, etc. Tips for prompt words: It is recommended to explicitly write "add" or "modify" as a prompt word.
zh_hans: 使用场景：个人形象装扮，比如增加配饰（如戴墨镜/戴耳环）、换发色等。 提示词技巧：提示词推荐显式写明“添加”、“修改”这类操作描述

# PartialRepaintImagePromptDescription
source: For adding or modifying operations, you can describe the prompt words in the following two ways. Method 1: Describe the specific action, such as "add a hat to the puppy". Method 2: Objectively describe the expected content, such as "a puppy wearing a hat". For deleting operations, you need to classify and handle them according to the actual situation: When deleting elements that occupy less space in the picture, the prompt word can be left blank (prompt=""). When deleting elements that occupy a large space in the picture, you need to describe the erased content in detail, such as "a transparent glass vase is placed on the table", rather than simply describing it as "delete xxx".
zh_hans: 针对增加或修改操作，您可通过以下两种方式描述提示词。 方式一：描述具体动作，例如“给小狗添加一顶帽子”。 方式二：客观描述期望生成的内容，例如“一只戴着帽子的小狗”。 针对删除操作，需根据实际情况分类处理： 删除占据图片空间较少的元素时，提示词可留空（prompt=""）。 删除占据图片空间较大的元素时，需详细描述擦除后的内容，例如“一个透明玻璃花瓶放在桌子上”，而非简单描述为“删除xxx”。

# DrawMask
source: Drawing Mask
zh_hans: 绘制蒙版

# TaskErrorResetPlease
source: Task failed, please try again!
zh_hans: 任务失败，请重试！

# ExpandImagePromptDescription
source: Usage scenarios: poster design (expanding the vertical image to horizontal to fit the cover size), secondary composition of photography (re-adjusting the subject position after expanding the background), etc. Tips for prompt words: The prompt words need to describe the content of the image after the expansion. Input prompt words: A family on the lawn in the park.
zh_hans: 使用场景：海报设计（将竖图扩为横版以适应封面尺寸）、摄影二次构图（扩展背景后重新调整主体位置）等。 提示词技巧：提示词需要描述扩图后的图片内容。 输入提示词：一家人在公园草坪上。

# RemoveWaterMarkPromptDescription
source: Use scenarios: secondary image processing (removing text interference), advertising design (removing brand watermarks), etc. Tips for prompt words: It is recommended to write the prompt word as "remove text from the image" or describe the type of text to be removed, such as "remove English text". Enter the prompt word: Remove text from the image.
zh_hans: 使用场景：图像二次处理（去除文字干扰）、广告设计（去除品牌水印标识）等。 提示词技巧：提示词推荐写为“去除图像中的文字”或者描述要去除的文字类型，比如“去除英文文字”。 输入提示词：去除图像中的文字。

# ImageSuperResolutionPromptDescription
source: Usage scenarios: restoration of old photos, high-definition printing of images (enlarging small-size images to high resolution), etc. Tips for prompt words: It is recommended to write the prompt word as "image super-resolution" or describe the super-resolution image. Input prompt word: Image super-resolution.
zh_hans: 使用场景：老旧照片修复、图像高清打印（将小尺寸图片放大到高分辨率）等。 提示词技巧：提示词推荐写为“图像超分”或描述超分后的图片。 输入提示词：图片超分。

source: Clarity
zh_hans: 清晰度

# ImageColorizationPromptDescription
source: Usage scenarios: historical photo restoration, children's picture book coloring, etc. Tips for prompt words: You can specify colors in the prompt words (such as "blue background, yellow leaves"). If the color is not specified, the model will automatically select the appropriate color.
zh_hans: 使用场景：历史照片还原、儿童绘本上色等。 提示词技巧：在提示词中可指定颜色（如“蓝色背景，黄色叶子”）。若未指定颜色，模型将自动选择适合的颜色。

# DoodlePromptDescription
source: Application scenarios: architectural concept design, illustration design, graffiti painting, etc. Tips for prompt words: The prompt words should describe the desired image content in detail. The more specific the description, the better the generation effect.
zh_hans: 使用场景：建筑概念设计、插画设计、涂鸦作画等。 提示词技巧：提示词应详细描述期望生成的图像内容，描述越具体，生成效果越好。

source: Use sketch
zh_hans: 使用线稿

# GraffitiPaintingPromptDescription
source: Hint words are used to describe the elements and visual features expected to be included in the generated image. Supports Chinese and English, with a length of no more than 75 characters, and the excess will be automatically truncated. Example value: a towering tree.
zh_hans: 提示词，用来描述生成图像中期望包含的元素和视觉特点。 支持中英文，长度不超过75个字符，超过部分会自动截断。 示例值：一棵参天大树。

source: Cartoon
zh_hans: 卡通

source: Watercolor
zh_hans: 水彩

source: Flat illustrations
zh_hans: 扁平插画

source: oil painting
zh_hans: 油画

source: auto
zh_hans: 默认

source: sketch
zh_hans: 素描

source: chinese painting
zh_hans: 中国画

source: Sketch Weight
zh_hans: 草图权重

source: Graffiti painting
zh_hans: 涂鸦作画

source: Graffiti style
zh_hans: 涂鸦风格

source: Image erasure and completion
zh_hans: 图像擦除补全

source: Strength
zh_hans: 强度

source: Draw the erase area
zh_hans: 绘制擦除区域

source: Draw reserved area
zh_hans: 绘制保留区域

source: Fast Mode
zh_hans: 快速模式

# GetKeyError
source: Failed to obtain key.
zh_hans: 获得key失败。

# PleaseDrawMaskFirst
source: Please draw the mask
zh_hans: 请绘制蒙版

# PleaseInputPrompt
source: Please enter a prompt word
zh_hans: 请输入提示词

# DoYouWantToClearRunningTasks
source: Are you sure you want to delete all running tasks?
zh_hans: 确定要删除所有正在执行的任务吗？

source: Resource Settings
zh_hans: 资源设置

source: Do you want to migrate resources?
zh_hans: 是否要迁移资源？

# TaskRunningNoSet
source: There is a task in progress and cannot be set!
zh_hans: 有正在进行的任务，无法设置！

source: Migration successful!
zh_hans: 迁移成功！

# MustLoginToUserInternet
source: You must log in to use the online function
zh_hans: 联网功能必须要登录才能使用

# InternetFunctionOnlyTabbycatAiModel
source: The networking function can only use TabbyCatAiModel
zh_hans: 联网功能只能使用TabbyCatAiModel

# MustLoginToUseDeepThinking
source: You must log in to use the Deep Thinking function
zh_hans: 深度思考功能必须要登录才能使用

# DeepThinkingOnlyTabbycatAiModel
source: Deep Thinking can only use TabbyCatAiModel
zh_hans: 深度思考只能使用TabbyCatAiModel

# UploadImageMustLogin
source: You must be logged in to upload pictures
zh_hans: 上传图片必须要登录

# PictureChatOnlyTabbycatAiModel
source: Picture chat only supports TabbyCatAiModel
zh_hans: 图片聊天仅支持TabbyCatAiModel

source: Contact
zh_hans: 联系人

# AddContact
source: Add a contact
zh_hans: 添加联系人

# MustInputContact
source: Please enter a name for your new contact
zh_hans: 请输入新联系人的名称

# MustInputContactDescription
source: Please enter a description for your contact
zh_hans: 请输入联系人描述

# ExistContactName
source: A contact named {0} already exists
zh_hans: 已经存在名为‘{0}’的联系人

source: Delete Contact
zh_hans: 删除联系人

# DeleteConversation
source: Delete this conversation
zh_hans: 删除该会话

# ThreeDCartoon
source: 3D Cartoon
zh_hans: 3D 卡通

source: Rename session
zh_hans: 重命名会话

# HasChatHistoryCannotDeleteContact
source: The current contact still has chat history. Please delete the chat history and try again.
zh_hans: 当前联系人还有聊天记录，请删除聊天记录后再试。

source: Send to
zh_hans: 发送到

source: Look
zh_hans: 查看

# ReferUploadedImageStyle
source: Refer to the uploaded image style
zh_hans: 参考上传图片风格

# ThreeDFairyTale
source: 3D Fairy Tale
zh_hans: 3D童话

# TwoDFairyTale
source: 2D Animation
zh_hans: 二次元

source: Small Fresh
zh_hans: 小清晰

source: Future Technology
zh_hans: 未来科技

source: Chinese painting ancient style
zh_hans: 国画古风

source: Armor style
zh_hans: 将军百战

source: Colorful cartoon
zh_hans: 炫彩卡通

source: Elegant Chinese style
zh_hans: 清雅国风

source: Elocutionist
fr_fr: Orateur
ja_jp: スピーカー
ko_kr: 연설가
zh_hans: 演说家

# WelcomeNewYear
source: Welcome the New Year
zh_hans: 喜迎新年

source: Retro comics
zh_hans: 复古漫画

source: Avatar Stylization
zh_hans: 人像风格重绘

# SelectReferenceImage
source: Select a reference image
zh_hans: 选择参考图片

source: Send Message
zh_hans: 发消息

source: Contact Description:
zh_hans: 联系人描述：

source: Ai Search
zh_hans: Ai搜索

source: Summarize
zh_hans: 总结

source: Translate
zh_hans: 翻译

source: Ask
zh_hans: 询问

# AskTemplate
source: Help me explain '{0}'
zh_hans: 帮我解释一下 “{0}”

# SummaryTemplate
source: Please help me summarize "{0}"
zh_hans: 请帮我总结一下 “{0}”

source: Japanese
zh_hans: 日语

source: Korean
zh_hans: 韩语

source: Thai
zh_hans: 泰语

source: French
zh_hans: 法语

source: German
zh_hans: 德语

source: Spanish
zh_hans: 西班牙语

source: Arabic
zh_hans: 阿拉伯语

source: Indonesian
zh_hans: 印尼语

source: Vietnamese
zh_hans: 越南语

source: Portuguese
zh_hans: 巴西葡萄牙语

source: Italian
zh_hans: 意大利语

source: Dutch
zh_hans: 荷兰语

source: Russian
zh_hans: 俄语

source: Khmer
zh_hans: 高棉语

source: Cebuano
zh_hans: 宿务语

source: Filipino
zh_hans: 菲律宾语

source: Czech
zh_hans: 捷克语

source: Data Scientist
fr_fr: Scientifique des données
ja_jp: データサイエンティスト
ko_kr: 데이터 과학자
zh_hans: 数据科学家

source: Polish
zh_hans: 波兰语

source: Persian
zh_hans: 波斯语

source: Hebrew
zh_hans: 希伯来语

source: Turkish
zh_hans: 土耳其语

source: Hindi
zh_hans: 印地语

source: Bengali
zh_hans: 孟加拉语

source: Urdu
zh_hans: 乌尔都语

# UseCpShowQuickMenu
source: Select the text or use Control+C (MAC: Command+C) to display shortcut options (requires restart)
zh_hans: 框选文本或者使用Control+C（MAC：Command+C）显示快捷选项（需要重启）

# MustLoginToUseFunction
source: You must be logged in to use this feature
zh_hans: 必须登录才能使用此功能
