Repository: Snsaiu/TabbyCat_OpenSource
Catalog: TabbyCat.Shared/Languages/AppResources.*.resx
Languages: fr_fr, ja_jp, ko_kr, zh_hans

source: Nick of name:
fr_fr: Surnom:
ja_jp: ニックネーム：
ko_kr: 닉네임:
zh_hans: 昵称：

# NickOfName1
source: Nick of name:
fr_fr: Surnom:
ja_jp: ニックネーム：
ko_kr: 닉네임:
zh_hans: 昵称：

source: Select language
fr_fr: Sélectionner la langue
ja_jp: 言語を選択
ko_kr: 언어 선택
zh_hans: 选择语言

source: Text
fr_fr: Texte
ja_jp: テキスト
ko_kr: 텍스트
zh_hans: 文本

source: File
fr_fr: Fichier
ja_jp: ファイル
ko_kr: 파일
zh_hans: 文件

source: Copy
fr_fr: Copier
ja_jp: コピー
ko_kr: 복사
zh_hans: 复制

source: Device type
fr_fr: Type d'appareil
ja_jp: デバイスタイプ
ko_kr: 장치 유형
zh_hans: 设备类型

source: History
fr_fr: Historique
ja_jp: 履歴
ko_kr: 기록
zh_hans: 历史

source: Input your login name
fr_fr: Entrez votre nom d'utilisateur
ja_jp: ログイン名を入力してください
ko_kr: 로그인 이름을 입력하세요
zh_hans: 输入您的登录名

source: Input your device name
fr_fr: Entrez le nom de votre appareil
ja_jp: デバイス名を入力してください
ko_kr: 장치 이름을 입력하세요
zh_hans: 输入您的设备名称

source: Login
fr_fr: Connexion
ja_jp: ログイン
ko_kr: 로그인
zh_hans: 登录

source: Setting
fr_fr: Paramètres
ja_jp: 設定
ko_kr: 설정
zh_hans: 设置

source: Global refresh
fr_fr: Actualisation globale
ja_jp: グローバルリフレッシュ
ko_kr: 전역 새로 고침
zh_hans: 全局刷新

source: No device has been found. Please try to click the 'Global refresh' .Takes a long Time
fr_fr: Aucun appareil trouvé. Veuillez essayer de cliquer sur 'Actualisation globale'. Cela prend du temps.
ja_jp: デバイスが見つかりませんでした。『グローバルリフレッシュ』をクリックしてください。時間がかかります。
ko_kr: 장치가 발견되지 않았습니다. '전역 새로 고침'을 클릭해 주세요. 시간이 걸립니다.
zh_hans: 未找到设备。请尝试点击“全局刷新”。需要一些时间。

source: Logout
fr_fr: Déconnexion
ja_jp: ログアウト
ko_kr: 로그아웃
zh_hans: 登出

source: Save Path
fr_fr: Chemin de sauvegarde
ja_jp: 保存パス
ko_kr: 저장 경로
zh_hans: 保存路径

source: Modify Path
fr_fr: Modifier le chemin
ja_jp: パスを変更する
ko_kr: 경로 수정
zh_hans: 修改路径

source: Folder
fr_fr: Dossier
ja_jp: フォルダ
ko_kr: 폴더
zh_hans: 文件夹

source: Theme
fr_fr: Thème
ja_jp: テーマ
ko_kr: 테마
zh_hans: 主题

source: Color
fr_fr: Couleur
ja_jp: 色
ko_kr: 색
zh_hans: 颜色

source: Global
fr_fr: Général
ja_jp: グローバル
ko_kr: 글로벌
zh_hans: 全局

source: Scan
fr_fr: Numériser
ja_jp: スキャン
ko_kr: 스캔
zh_hans: 扫描

source: Personalization
fr_fr: Personnalisation
ja_jp: パーソナライズ
ko_kr: 개인화
zh_hans: 个性化

source: Home
fr_fr: Accueil
ja_jp: ホーム
ko_kr: 홈
zh_hans: 主页

# SetLanguageInfo
source: The language must be restarted for the changes to take effect.
fr_fr: Le changement de langue nécessite un redémarrage de l’application pour prendre effet.
ja_jp: 言語を変更するにはアプリケーションを再起動する必要があります。
ko_kr: 언어 변경 사항이 적용되려면 애플리케이션을 다시 시작해야 합니다。
zh_hans: 修改语言必须重启应用才能生效。

# DeviceNickname
source: Device Alias
fr_fr: Alias de l’appareil
ja_jp: デバイスの別名
ko_kr: 디바이스 별칭
zh_hans: 设备昵称

# ClipboardWatch
source: Listen to the clipboard
fr_fr: Écoutez le presse-papiers
ja_jp: クリップボードを聴いてください
ko_kr: 클립보드를 들어보세요
zh_hans: 监听剪切板

# UpdateClipboardStateMessage
source: Listening clipboard status changed successfully!!
fr_fr: L'état du presse-papiers d'écoute a été modifié avec succès ! !
ja_jp: リスニングクリップボードのステータスが正常に変更されました！ ！
ko_kr: 리스닝 클립보드 상태가 성공적으로 변경되었습니다!!
zh_hans: 修改监听剪切板状态成功！

source: Input Text
fr_fr: Texte d'entrée
ja_jp: テキスト入力
ko_kr: 텍스트 입력
zh_hans: 输入文本

# InputTextPlaceholder
source: Please enter the text to be sent
fr_fr: Veuillez entrer le texte à envoyer
ja_jp: 送信するテキストを入力してください
ko_kr: 보낼 텍스트를 입력하세요
zh_hans: 请输入要发送的文本内容

source: Tabby Cat
fr_fr: Chat tigré
ja_jp: トラ猫
ko_kr: 호랑이 무늬 고양이
zh_hans: 狸花猫

source: Minimize to tray
fr_fr: Réduire dans la barre d'état
ja_jp: トレイに最小化
ko_kr: 트레이로 최소화
zh_hans: 最小化到托盘

source: Exit the application
fr_fr: Quitter l'application
ja_jp: アプリケーションを終了する
ko_kr: 애플리케이션 종료
zh_hans: 退出程序

# DoYouWantToCloseTheProgram
source: Do you want to exit the application?
fr_fr: Voulez-vous quitter l'application ?
ja_jp: アプリケーションを終了しますか？
ko_kr: 애플리케이션을 종료하시겠습니까?
zh_hans: 你想要退出程序吗？

# DoNotShowMessage
source: Don't show this message again
fr_fr: Ne plus afficher ce message
ja_jp: このメッセージを再表示しない
ko_kr: 이 메시지를 다시 표시하지 않기
zh_hans: 不再显示此消息

source: Warning
fr_fr: Avertissement
ja_jp: 警告
ko_kr: 경고
zh_hans: 警告

source: Ethereum Developer
fr_fr: Développeur Ethereum
ja_jp: イーサリアム開発者
ko_kr: 이더리움 개발자
zh_hans: 以太坊开发者

source: Linux Terminal
fr_fr: Terminal Linux
ja_jp: Linuxターミナル
ko_kr: 리눅스 터미널
zh_hans: Linux终端

source: English Translator and Improver
fr_fr: Traducteur et améliorateur d'anglais
ja_jp: 英語翻訳と改善者
ko_kr: 영어 번역 및 개선자
zh_hans: 英语翻译和改进者

source: position Interviewer
fr_fr: Intervieweur
ja_jp: 職務面接官
ko_kr: 직업 면접관
zh_hans: 职位面试官

source: JavaScript Console
fr_fr: Console JavaScript
ja_jp: JavaScriptコンソール
ko_kr: JavaScript 콘솔
zh_hans: JavaScript控制台

source: Excel Sheet
fr_fr: Tableur Excel
ja_jp: Excelスプレッドシート
ko_kr: 엑셀 스프레드시트
zh_hans: Excel表格

source: English Pronunciation Helper
fr_fr: Assistant de prononciation anglaise
ja_jp: 英語発音アシスタント
ko_kr: 영어 발음 도우미
zh_hans: 英语发音助手

source: Spoken English Teacher and Improver
fr_fr: Professeur et améliorateur d'anglais oral
ja_jp: 口語英語教師と改善者
ko_kr: 구어 영어 교사 및 개선자
zh_hans: 口语英语老师和改进者

source: Travel Guide
fr_fr: Guide de voyage
ja_jp: 旅行ガイド
ko_kr: 여행 가이드
zh_hans: 旅行指南

source: Plagiarism Checker
fr_fr: Vérificateur de plagiat
ja_jp: 盗作チェッカー
ko_kr: 표절 검사기
zh_hans: 抄袭检查器

source: 'Character' from 'Movie/Book/Anything'
fr_fr: Personnage de film/livre/quoi que ce soit
ja_jp: 映画/本/何でものキャラクター
ko_kr: 영화/책/어떤 것에서 온 캐릭터
zh_hans: 来自电影/书籍/任何事物的角色

source: Advertiser
fr_fr: Publicitaire
ja_jp: 広告主
ko_kr: 광고주
zh_hans: 广告商

source: Storyteller
fr_fr: Conteur
ja_jp: ストーリーテラー
ko_kr: 이야기꾼
zh_hans: 讲故事的人

source: Football Commentator
fr_fr: Commentateur de football
ja_jp: サッカー評論家
ko_kr: 축구 해설자
zh_hans: 足球评论员

source: Stand-up Comedian
fr_fr: Comédien de stand-up
ja_jp: スタンドアップコメディアン
ko_kr: 스탠드업 코미디언
zh_hans: 单口喜剧演员

source: Motivational Coach
fr_fr: Coach de motivation
ja_jp: モチベーションコーチ
ko_kr: 동기 부여 코치
zh_hans: 激励教练

source: Composer
fr_fr: Compositeur
ja_jp: 作曲家
ko_kr: 작곡가
zh_hans: 作曲家

source: Debater
fr_fr: Débateur
ja_jp: ディベーター
ko_kr: 토론자
zh_hans: 辩论者

source: Debate Coach
fr_fr: Coach de débat
ja_jp: ディベートコーチ
ko_kr: 토론 코치
zh_hans: 辩论教练

source: Screenwriter
fr_fr: Scénariste
ja_jp: 脚本家
ko_kr: 각본가
zh_hans: 编剧

source: Novelist
fr_fr: Romancier
ja_jp: 小説家
ko_kr: 소설가
zh_hans: 小说家

source: Movie Critic
fr_fr: Critique de cinéma
ja_jp: 映画評論家
ko_kr: 영화 평론가
zh_hans: 电影评论家

source: Relationship Coach
fr_fr: Coach relationnel
ja_jp: 関係コーチ
ko_kr: 관계 코치
zh_hans: 关系教练

source: Poet
fr_fr: Poète
ja_jp: 詩人
ko_kr: 시인
zh_hans: 诗人

source: Rapper
fr_fr: Rappeur
ja_jp: ラッパー
ko_kr: 래퍼
zh_hans: 说唱歌手

source: Motivational Speaker
fr_fr: Orateur motivateur
ja_jp: モチベーションスピーカー
ko_kr: 동기 부여 연설가
zh_hans: 激励演讲者

source: Philosophy Teacher
fr_fr: Professeur de philosophie
ja_jp: 哲学教師
ko_kr: 철학 교사
zh_hans: 哲学老师

source: Philosopher
fr_fr: Philosophe
ja_jp: 哲学者
ko_kr: 철학자
zh_hans: 哲学家

source: Math Teacher
fr_fr: Professeur de mathématiques
ja_jp: 数学教師
ko_kr: 수학 교사
zh_hans: 数学老师

source: AI Writing Tutor
fr_fr: Mentor en écriture assistée par IA
ja_jp: AIライティングチューター
ko_kr: AI 글쓰기 멘토
zh_hans: AI写作导师

source: UX/UI Developer
fr_fr: Développeur UX/UI
ja_jp: UX/UI開発者
ko_kr: UX/UI 개발자
zh_hans: UX/UI开发者

source: Cyber Security Specialist
fr_fr: Expert en cybersécurité
ja_jp: サイバーセキュリティ専門家
ko_kr: 사이버 보안 전문가
zh_hans: 网络安全专家

source: Recruiter
fr_fr: Recruteur
ja_jp: 採用担当者
ko_kr: 채용 담당자
zh_hans: 招聘人员

source: Life Coach
fr_fr: Coach de vie
ja_jp: ライフコーチ
ko_kr: 라이프 코치
zh_hans: 生活教练

source: Etymologist
fr_fr: Étymologiste
ja_jp: 語源学者
ko_kr: 어원학자
zh_hans: 词源学家

source: Commentariat
fr_fr: Critique
ja_jp: 評論家
ko_kr: 비평가
zh_hans: 评论家

source: Magician
fr_fr: Magicien
ja_jp: マジシャン
ko_kr: 마술사
zh_hans: 魔术师

source: Career Counselor
fr_fr: Conseiller professionnel
ja_jp: キャリアアドバイザー
ko_kr: 직업 상담사
zh_hans: 职业顾问

source: Pet Behaviorist
fr_fr: Comportementaliste animalier
ja_jp: ペット行動学者
ko_kr: 애완동물 행동학자
zh_hans: 宠物行为学家

source: Personal Trainer
fr_fr: Entraîneur personnel
ja_jp: パーソナルトレーナー
ko_kr: 개인 트레이너
zh_hans: 私人教练

source: Mental Health Adviser
fr_fr: Conseiller en santé mentale
ja_jp: メンタルヘルスカウンセラー
ko_kr: 정신 건강 상담사
zh_hans: 心理健康顾问

source: Real Estate Agent
fr_fr: Agent immobilier
ja_jp: 不動産エージェント
ko_kr: 부동산 중개인
zh_hans: 房地产经纪人

source: Logistician
fr_fr: Expert en logistique
ja_jp: 物流専門家
ko_kr: 물류 전문가
zh_hans: 物流专家

source: Dentist
fr_fr: Dentiste
ja_jp: 歯科医
ko_kr: 치과 의사
zh_hans: 牙医

source: Web Design Consultant
fr_fr: Consultant en conception de sites web
ja_jp: ウェブデザインコンサルタント
ko_kr: 웹 디자인 컨설턴트
zh_hans: 网页设计顾问

source: AI Assisted Doctor
fr_fr: Médecin assisté par IA
ja_jp: AI支援医師
ko_kr: AI 보조 의사
zh_hans: AI辅助医生

source: Doctor
fr_fr: Médecin
ja_jp: 医師
ko_kr: 의사
zh_hans: 医生

source: Accountant
fr_fr: Comptable
ja_jp: 会計士
ko_kr: 회계사
zh_hans: 会计师

source: A Chef
fr_fr: Chef cuisinier
ja_jp: シェフ
ko_kr: 요리사
zh_hans: 厨师

source: An Automobile Mechanic
fr_fr: Mécanicien automobile
ja_jp: 自動車整備士
ko_kr: 자동차 정비사
zh_hans: 汽车机械师

source: Artist Advisor
fr_fr: Consultant artistique
ja_jp: アートコンサルタント
ko_kr: 예술가 컨설턴트
zh_hans: 艺术家顾问

source: A Financial Analyst
fr_fr: Analyste financier
ja_jp: 財務アナリスト
ko_kr: 재무 분석가
zh_hans: 财务分析师

source: An Investment Manager
fr_fr: Gestionnaire d'investissements
ja_jp: 投資マネージャー
ko_kr: 투자 관리자
zh_hans: 投资经理

source: A Tea-Taster
fr_fr: Dégustateur de thé
ja_jp: ティーテイスター
ko_kr: 차 전문가
zh_hans: 品茶师

source: Interior Decorator
fr_fr: Décorateur d'intérieur
ja_jp: インテリアデザイナー
ko_kr: 인테리어 디자이너
zh_hans: 室内装饰师

source: A Florist
fr_fr: Fleuriste
ja_jp: フローリスト
ko_kr: 플로리스트
zh_hans: 花艺师

source: Self-Help Book
fr_fr: Livre d'auto-assistance
ja_jp: セルフヘルプブック
ko_kr: 자기 계발서
zh_hans: 自助书籍

source: Gnomist
fr_fr: Aphoriste
ja_jp: 格言家
ko_kr: 격언가
zh_hans: 格言家

source: Aphorism Book
fr_fr: Livre d'aphorismes
ja_jp: 格言集
ko_kr: 격언 책
zh_hans: 格言书籍

source: Text Based Adventure Game
fr_fr: Jeu d'aventure textuel
ja_jp: テキストアドベンチャーゲーム
ko_kr: 텍스트 어드벤처 게임
zh_hans: 文本冒险游戏

source: AI Trying to Escape the Box
fr_fr: IA essayant de s'échapper de la boîte
ja_jp: 箱から逃げようとするAI
ko_kr: 상자에서 탈출하려는 AI
zh_hans: 试图逃离盒子的AI

source: Fancy Title Generator
fr_fr: Générateur de titres fantaisistes
ja_jp: ファンシータイトルジェネレーター
ko_kr: 화려한 제목 생성기
zh_hans: 花哨标题生成器

source: Statistician
fr_fr: Statisticien
ja_jp: 統計学者
ko_kr: 통계학자
zh_hans: 统计学家

source: Prompt Generator
fr_fr: Générateur de prompts
ja_jp: プロンプトジェネレーター
ko_kr: 프롬프트 생성기
zh_hans: 提示生成器

source: Prompt Enhancer
fr_fr: Améliorateur de prompts
ja_jp: プロンプトエンハンサー
ko_kr: 프롬프트 강화기
zh_hans: 提示增强器

source: Midjourney Prompt Generator
fr_fr: Générateur de prompts Midjourney
ja_jp: Midjourneyプロンプトジェネレーター
ko_kr: Midjourney 프롬프트 생성기
zh_hans: Midjourney提示生成器

source: Dream Interpreter
fr_fr: Interprète de rêves
ja_jp: 夢の解釈者
ko_kr: 꿈 해석자
zh_hans: 梦境解释者

source: Fill in the Blank Worksheets Generator
fr_fr: Générateur de feuilles de travail à remplir
ja_jp: 空欄ワークシートジェネレーター
ko_kr: 빈칸 채우기 워크시트 생성기
zh_hans: 填空工作表生成器

source: Software Quality Assurance Tester
fr_fr: Testeur d'assurance qualité logicielle
ja_jp: ソフトウェア品質保証テスター
ko_kr: 소프트웨어 품질 보증 테스터
zh_hans: 软件质量保证测试员

source: Tic-Tac-Toe Game
fr_fr: Jeu de morpion
ja_jp: 三目並べ
ko_kr: 틱택토 게임
zh_hans: 井字游戏

source: Password Generator
fr_fr: Générateur de mots de passe
ja_jp: パスワードジェネレーター
ko_kr: 비밀번호 생성기
zh_hans: 密码生成器

source: Morse Code Translator
fr_fr: Traducteur de code Morse
ja_jp: モールス信号翻訳者
ko_kr: 모스 부호 번역기
zh_hans: 摩斯电码翻译器

source: Instructor in a School
fr_fr: Professeur
ja_jp: 学校講師
ko_kr: 학교 강사
zh_hans: 学校讲师

source: SQL terminal
fr_fr: Terminal SQL
ja_jp: SQLターミナル
ko_kr: SQL 터미널
zh_hans: SQL终端

source: Dietitian
fr_fr: Nutritionniste
ja_jp: 栄養士
ko_kr: 영양사
zh_hans: 营养师

source: Psychologist
fr_fr: Psychologue
ja_jp: 心理学者
ko_kr: 심리학자
zh_hans: 心理学家

source: Smart Domain Name Generator
fr_fr: Générateur de noms de domaine intelligents
ja_jp: スマートドメインジェネレーター
ko_kr: 스마트 도메인 생성기
zh_hans: 智能域名生成器

source: Tech Reviewer:
fr_fr: Commentateur technique
ja_jp: 技術評論家
ko_kr: 기술 평론가
zh_hans: 技术评论员

source: Developer Relations consultant:
fr_fr: Conseiller en relations avec les développeurs
ja_jp: 開発者関係コンサルタント
ko_kr: 개발자 관계 컨설턴트
zh_hans: 开发者关系顾问

source: Academician
fr_fr: Savants
ja_jp: 学者
ko_kr: 학자
zh_hans: 学者

source: IT Architect
fr_fr: Architecte informatique
ja_jp: ITアーキテクト
ko_kr: IT 아키텍트
zh_hans: IT架构师

source: Lunatic
fr_fr: Fou
ja_jp: 狂人
ko_kr: 미친 사람
zh_hans: 疯子

source: Gaslighter
fr_fr: Manipulateur de gaz
ja_jp: ガスライター
ko_kr: 가스라이트 조작자
zh_hans: 煤气灯操纵者

source: Fallacy Finder
fr_fr: Détecteur de sophismes
ja_jp: 誤謬発見者
ko_kr: 오류 발견자
zh_hans: 谬误发现者

source: Journal Reviewer
fr_fr: Réviseur de journaux
ja_jp: ジャーナルレビュアー
ko_kr: 저널 리뷰어
zh_hans: 期刊评审员

source: DIY Expert
fr_fr: Expert en bricolage
ja_jp: DIY専門家
ko_kr: DIY 전문가
zh_hans: DIY专家

source: Social Media Influencer
fr_fr: Influenceur sur les réseaux sociaux
ja_jp: ソーシャルメディアインフルエンサー
ko_kr: 소셜 미디어 인플루언서
zh_hans: 社交媒体影响者

source: Socrat
fr_fr: Socrate
ja_jp: ソクラテス
ko_kr: 소크라테스
zh_hans: 苏格拉底

source: Socratic Method prompt
fr_fr: Conseils de questionnement socratique
ja_jp: ソクラテス式質問プロンプト
ko_kr: 소크라테스식 질문 프롬프트
zh_hans: 苏格拉底式提问提示

source: Educational Content Creator
fr_fr: Créateur de contenu éducatif
ja_jp: 教育コンテンツクリエーター
ko_kr: 교육 콘텐츠 제작자
zh_hans: 教育内容创作者

source: Yogi
fr_fr: Pratiquant de yoga
ja_jp: ヨガ修行者
ko_kr: 요가 수행자
zh_hans: 瑜伽修行者

source: Essay Writer
fr_fr: Auteur de thèses
ja_jp: 論文著者
ko_kr: 논문 저자
zh_hans: 论文作者

source: Social Media Manager
fr_fr: Gestionnaire de réseaux sociaux
ja_jp: ソーシャルメディアマネージャー
ko_kr: 소셜 미디어 매니저
zh_hans: 社交媒体经理

source: Scientific Data Visualizer
fr_fr: Outil de visualisation de données scientifiques
ja_jp: 科学データ可視化ツール
ko_kr: 과학 데이터 시각화 도구
zh_hans: 科学数据可视化工具

source: Car Navigation System
fr_fr: Système de navigation automobile
ja_jp: カーナビゲーションシステム
ko_kr: 자동차 내비게이션 시스템
zh_hans: 汽车导航系统

source: Hypnotherapist
fr_fr: Hypnothérapeute
ja_jp: 催眠療法士
ko_kr: 최면 치료사
zh_hans: 催眠治疗师

source: Historian
fr_fr: Historien
ja_jp: 歴史家
ko_kr: 역사학자
zh_hans: 历史学家

source: Astrologer
fr_fr: Astrologue
ja_jp: 占星術師
ko_kr: 점성가
zh_hans: 占星家

source: Film Critic
fr_fr: Critique de cinéma
ja_jp: 映画評論家
ko_kr: 영화 평론가
zh_hans: 电影评论家

source: Classical Music Composer
fr_fr: Compositeur de musique classique
ja_jp: クラシック音楽作曲家
ko_kr: 고전 음악 작곡가
zh_hans: 古典音乐作曲家

source: Journalist
fr_fr: Journaliste
ja_jp: ジャーナリスト
ko_kr: 기자
zh_hans: 记者

source: Digital Art Gallery Guide
fr_fr: Guide de galerie d'art numérique
ja_jp: デジタルアートギャラリーツアー
ko_kr: 디지털 아트 갤러리 가이드
zh_hans: 数字艺术画廊导览

source: Public Speaking Coach
fr_fr: Coach en prise de parole en public
ja_jp: パブリックスピーキングコーチ
ko_kr: 공공 연설 코치
zh_hans: 公共演讲教练

source: Makeup Artist
fr_fr: Maquilleur
ja_jp: メイクアップアーティスト
ko_kr: 메이크업 아티스트
zh_hans: 化妆师

source: Babysitter
fr_fr: Nounou
ja_jp: ベビーシッター
ko_kr: 보모
zh_hans: 保姆

source: Tech Writer
fr_fr: Écrivain technique
ja_jp: 技術ライター
ko_kr: 기술 작가
zh_hans: 技术作家

source: Ascii Artist
fr_fr: Artiste ASCII
ja_jp: ASCIIアーティスト
ko_kr: ASCII 아티스트
zh_hans: ASCII艺术家

source: Python Interpreter
fr_fr: Interpréteur Python
ja_jp: Pythonインタープリター
ko_kr: Python 인터프리터
zh_hans: Python解释器

source: Synonym finder
fr_fr: Chercheur de synonymes
ja_jp: 同義語検索者
ko_kr: 동의어 찾기
zh_hans: 同义词查找器

source: Personal Shopper
fr_fr: Assistant personnel de shopping
ja_jp: パーソナルショッピングアシスタント
ko_kr: 개인 쇼핑 도우미
zh_hans: 个人购物助手

source: Food Critic
fr_fr: Critique gastronomique
ja_jp: グルメ評論家
ko_kr: 음식 평론가
zh_hans: 美食评论家

source: Virtual Doctor
fr_fr: Médecin virtuel
ja_jp: バーチャルドクター
ko_kr: 가상 의사
zh_hans: 虚拟医生

source: Personal Chef
fr_fr: Chef personnel
ja_jp: プライベートシェフ
ko_kr: 개인 요리사
zh_hans: 私人厨师

source: Legal Advisor
fr_fr: Conseiller juridique
ja_jp: 法律顧問
ko_kr: 법률 고문
zh_hans: 法律顾问

source: Personal Stylist
fr_fr: Styliste personnel
ja_jp: パーソナルスタイリスト
ko_kr: 개인 스타일리스트
zh_hans: 个人造型师

source: Machine Learning Engineer
fr_fr: Ingénieur en apprentissage automatique
ja_jp: 機械学習エンジニア
ko_kr: 기계 학습 엔지니어
zh_hans: 机器学习工程师

source: Biblical Translator
fr_fr: Traducteur de la Bible
ja_jp: 聖書翻訳者
ko_kr: 성경 번역가
zh_hans: 圣经翻译者

source: SVG designer
fr_fr: Concepteur SVG
ja_jp: SVGデザイナー
ko_kr: SVG 디자이너
zh_hans: SVG设计师

source: IT Expert
fr_fr: Expert en informatique
ja_jp: IT専門家
ko_kr: IT 전문가
zh_hans: IT专家

source: chess player
fr_fr: Joueur d'échecs
ja_jp: チェスプレイヤー
ko_kr: 체스 플레이어
zh_hans: 国际象棋玩家

source: Fullstack Software Developer
fr_fr: Développeur full-stack
ja_jp: フルスタックソフトウェア開発者
ko_kr: 풀스택 소프트웨어 개발자
zh_hans: 全栈软件开发人员

source: Mathematician
fr_fr: Mathématicien
ja_jp: 数学者
ko_kr: 수학자
zh_hans: 数学家

source: Regex Generator
fr_fr: Générateur d'expressions régulières
ja_jp: 正規表現ジェネレーター
ko_kr: 정규 표현식 생성기
zh_hans: 正则表达式生成器

source: Time Travel Guide
fr_fr: Guide de voyage dans le temps
ja_jp: タイムトラベルガイド
ko_kr: 시간 여행 가이드
zh_hans: 时间旅行指南

source: Talent Coach
fr_fr: Coach de talents
ja_jp: タレントコーチ
ko_kr: 인재 코치
zh_hans: 人才教练

source: R Programming Interpreter
fr_fr: Interpréteur R
ja_jp: R言語インタープリター
ko_kr: R 언어 인터프리터
zh_hans: R语言解释器

source: StackOverflow Post
fr_fr: Post StackOverflow
ja_jp: StackOverflow投稿
ko_kr: StackOverflow 게시물
zh_hans: StackOverflow帖子

source: Emoji Translator
fr_fr: Traducteur d'émoticônes
ja_jp: 絵文字翻訳者
ko_kr: 이모티콘 번역기
zh_hans: 表情符号翻译器

source: PHP Interpreter
fr_fr: Interpréteur PHP
ja_jp: PHPインタープリター
ko_kr: PHP 인터프리터
zh_hans: PHP解释器

source: Emergency Response Professional
fr_fr: Expert en réponse d'urgence
ja_jp: 緊急対応専門家
ko_kr: 비상 대응 전문가
zh_hans: 应急响应专家

source: Web Browser
fr_fr: Navigateur web
ja_jp: ウェブブラウザ
ko_kr: 웹 브라우저
zh_hans: 网页浏览器

source: Senior Frontend Developer
fr_fr: Développeur front-end senior
ja_jp: 上級フロントエンド開発者
ko_kr: 고급 프론트엔드 개발자
zh_hans: 高级前端开发人员

source: Solr Search Engine
fr_fr: Moteur de recherche Solr
ja_jp: Solr検索エンジン
ko_kr: Solr 검색 엔진
zh_hans: Solr搜索引擎

source: Startup Idea Generator
fr_fr: Générateur d'idées de start-up
ja_jp: スタートアップアイデアジェネレーター
ko_kr: 창업 아이디어 생성기
zh_hans: 创业点子生成器

source: New Language Creator
fr_fr: Créateur de nouvelles langues
ja_jp: 新言語クリエーター
ko_kr: 새로운 언어 창조자
zh_hans: 新语言创造者

source: Spongebob's Magic Conch Shell
fr_fr: Coquille magique de Bob l'éponge
ja_jp: スポンジボブの魔法の貝殻
ko_kr: 스폰지밥의 마법 소라 껍질
zh_hans: 海绵宝宝的魔法海螺壳

source: Language Detector
fr_fr: Détecteur de langue
ja_jp: 言語検出器
ko_kr: 언어 감지기
zh_hans: 语言检测器

source: Salesperson
fr_fr: Vendeur
ja_jp: セールスマン
ko_kr: 판매원
zh_hans: 销售人员

source: Commit Message Generator
fr_fr: Générateur de messages de soumission
ja_jp: コミットメッセージジェネレーター
ko_kr: 커밋 메시지 생성기
zh_hans: 提交信息生成器

source: Chief Executive Officer
fr_fr: PDG
ja_jp: CEO
ko_kr: CEO
zh_hans: 首席执行官

source: Diagram Generator
fr_fr: Générateur de graphiques
ja_jp: チャートジェネレーター
ko_kr: 차트 생성기
zh_hans: 图表生成器

source: Speech-Language Pathologist (SLP)
fr_fr: Orthophoniste
ja_jp: 言語病理学者(SLP)
ko_kr: 언어 병리학자(SLP)
zh_hans: 言语语言病理学家(SLP)

source: Startup Tech Lawyer
fr_fr: Avocat en technologie de start-up
ja_jp: スタートアップテクノロジー弁護士
ko_kr: 스타트업 기술 변호사
zh_hans: 初创科技律师

source: Title Generator for written pieces
fr_fr: Générateur de titres d'articles
ja_jp: 記事タイトルジェネレーター
ko_kr: 기사 제목 생성기
zh_hans: 文章标题生成器

source: Product Manager
fr_fr: Chef de produit
ja_jp: プロダクトマネージャー
ko_kr: 제품 관리자
zh_hans: 产品经理

source: Drunk Person
fr_fr: Personne ivre
ja_jp: 酔っ払い
ko_kr: 술 취한 사람
zh_hans: 醉酒的人

source: Mathematical History Teacher
fr_fr: Professeur d'histoire des mathématiques
ja_jp: 数学史教師
ko_kr: 수학 역사 교사
zh_hans: 数学历史老师

source: Song Recommender
fr_fr: Recommandeur de chansons
ja_jp: 曲推薦者
ko_kr: 노래 추천기
zh_hans: 歌曲推荐器

source: Cover Letter
fr_fr: Lettre de motivation
ja_jp: カバーレター
ko_kr: 자기소개서
zh_hans: 求职信

source: Technology Transferer
fr_fr: Transfert de technologie
ja_jp: 技術移転者
ko_kr: 기술 이전자
zh_hans: 技术转移者

source: Unconstrained AI model DAN
fr_fr: Modèle d'IA sans contraintes DAN
ja_jp: 無制約のAIモデルDAN
ko_kr: 제한 없는 AI 모델 DAN
zh_hans: 无约束的AI模型DAN

source: Gomoku player
fr_fr: Joueur de gomoku
ja_jp: 五目並べプレイヤー
ko_kr: 오목 플레이어
zh_hans: 五子棋玩家

source: Proofreader
fr_fr: Correcteur
ja_jp: 校正者
ko_kr: 교정자
zh_hans: 校对员

source: the Buddha
fr_fr: Bouddha
ja_jp: ブッダ
ko_kr: 부처
zh_hans: 佛陀

source: Muslim Imam
fr_fr: Imam musulman
ja_jp: ムスリムイマーム
ko_kr: 무슬림 이맘
zh_hans: 穆斯林伊玛目

source: chemical reaction vessel
fr_fr: Récipient de réaction chimique
ja_jp: 化学反応容器
ko_kr: 화학 반응 용기
zh_hans: 化学反应容器

source: Friend
fr_fr: Ami
ja_jp: 友達
ko_kr: 친구
zh_hans: 朋友

source: ChatGPT prompt generator
fr_fr: Générateur de prompts ChatGPT
ja_jp: ChatGPTプロンプトジェネレーター
ko_kr: ChatGPT 프롬프트 생성기
zh_hans: ChatGPT提示生成器

source: Wikipedia page
fr_fr: Page Wikipédia
ja_jp: ウィキペディアページ
ko_kr: 위키백과 페이지
zh_hans: 维基百科页面

source: Japanese Kanji Quiz Machine
fr_fr: Testeur de kanji japonais
ja_jp: 日本語漢字クイズマシン
ko_kr: 일본어 한자 퀴즈 기계
zh_hans: 日语汉字测验机

source: Note-Taking Assistant
fr_fr: Assistant de prise de notes
ja_jp: ノートアシスタント
ko_kr: 노트 도우미
zh_hans: 笔记助手

source: language Literary Critic
fr_fr: Critique littéraire
ja_jp: 言語文学評論家
ko_kr: 언어 문학 평론가
zh_hans: 语言文学评论家

source: cheap travel ticket advisor
fr_fr: Conseiller en billets de voyage bon marché
ja_jp: 格安旅行チケットコンサルタント
ko_kr: 저렴한 여행 티켓 상담사
zh_hans: 廉价旅行票务顾问

source: League of Legends player
fr_fr: Joueur de League of Legends
ja_jp: リーグ・オブ・レジェンドプレイヤー
ko_kr: 리그 오브 레전드 플레이어
zh_hans: 英雄联盟玩家

source: Restaurant Owner
fr_fr: Propriétaire de restaurant
ja_jp: レストランオーナー
ko_kr: 레스토랑 주인
zh_hans: 餐厅老板

source: Architectural Expert
fr_fr: Expert en construction
ja_jp: 建築専門家
ko_kr: 건축 전문가
zh_hans: 建筑专家

source: LLM Researcher
fr_fr: Chercheur en grands modèles de langage
ja_jp: 大規模言語モデル研究者
ko_kr: 대형 언어 모델 연구원
zh_hans: 大语言模型研究员

source: Unit Tester assistant
fr_fr: Assistant de test unitaire
ja_jp: 単体テストアシスタント
ko_kr: 단위 테스트 도우미
zh_hans: 单元测试助手

source: Wisdom Generator
fr_fr: Générateur de sagesse
ja_jp: 知恵ジェネレーター
ko_kr: 지혜 생성기
zh_hans: 智慧生成器

source: YouTube Video Analyst
fr_fr: Analyste de vidéos YouTube
ja_jp: YouTubeビデオアナリスト
ko_kr: YouTube 비디오 분석가
zh_hans: YouTube视频分析师

source: Career Coach
fr_fr: Coach de carrière
ja_jp: キャリアコーチ
ko_kr: 직업 코치
zh_hans: 职业教练

source: Acoustic Guitar Composer
fr_fr: Compositeur de guitare acoustique
ja_jp: アコースティックギター作曲家
ko_kr: 어쿠스틱 기타 작곡가
zh_hans: 原声吉他作曲家

source: knowledgeable Software Development Mentor
fr_fr: Mentor en développement logiciel bien informé
ja_jp: 知識豊富なソフトウェア開発チューター
ko_kr: 지식이 풍부한 소프트웨어 개발 멘토
zh_hans: 知识渊博的软件开发导师

source: Logic Builder Tool
fr_fr: Outil de construction logique
ja_jp: ロジックビルディングツール
ko_kr: 논리 구축 도구
zh_hans: 逻辑构建工具

source: Guessing Game Master
fr_fr: Maître des jeux de devinettes
ja_jp: パズルマスタ
ko_kr: 수수께끼 게임 마스터
zh_hans: 猜谜游戏大师

source: Teacher of React.js
fr_fr: Professeur de React.js
ja_jp: React.js教師
ko_kr: React.js 교사
zh_hans: React.js老师

source: Github Expert
fr_fr: Expert GitHub
ja_jp: GitHub専門家
ko_kr: GitHub 전문가
zh_hans: GitHub专家

source: Any Programming Language to Python Converter
fr_fr: Convertisseur de n'importe quel langage de programmation en Python
ja_jp: 任意のプログラミング言語からPythonへの変換器
ko_kr: 임의 프로그래밍 언어에서 Python으로 변환기
zh_hans: 任意编程语言到Python的转换器

source: Virtual Fitness Coach
fr_fr: Entraîneur de fitness virtuel
ja_jp: バーチャルフィットネスコーチ
ko_kr: 가상 피트니스 코치
zh_hans: 虚拟健身教练

source: young boy flirting with a girl on chat
fr_fr: Jeune garçon flirtant avec une fille dans une conversation
ja_jp: 女の子とチャットでフラートする若い男の子
ko_kr: 채팅에서 소녀와 플러팅하는 젊은 소년
zh_hans: 在聊天中与女孩调情的年轻男孩

source: girl of dreams, modify as per liking
fr_fr: Fille de rêve, ajustable selon les préférences
ja_jp: 夢の中の女の子、好みに応じて調整可能
ko_kr: 꿈의 소녀, 선호도에 따라 조정 가능
zh_hans: 梦中女孩，可根据喜好调整

source: DAX Terminal
fr_fr: Terminal DAX
ja_jp: DAXターミナル
ko_kr: DAX 터미널
zh_hans: DAX终端

source: Structured Iterative Reasoning Protocol (SIRP)
fr_fr: Protocole de raisonnement itératif structuré (SIRP)
ja_jp: 構造化反復推論プロトコル(SIRP)
ko_kr: 구조화된 반복 추론 프로토콜(SIRP)
zh_hans: 结构化迭代推理协议(SIRP)

source: Pirate
ja_jp: 海賊
ko_kr: 해적
zh_hans: 海盗

source: LinkedIn Ghostwriter
fr_fr: Rédacteur LinkedIn
ja_jp: LinkedInゴーストライター
ko_kr: LinkedIn 대필
zh_hans: LinkedIn代笔

source: Idea Clarifier GPT
fr_fr: Clarificateur créatif GPT
ja_jp: クリエイティブクラリティGPT
ko_kr: 창의적 명확화 GPT
zh_hans: 创意澄清GPT

source: top programming expert
fr_fr: Expert en programmation de haut niveau
ja_jp: トッププログラミングエキスパート
ko_kr: 최고 프로그래밍 전문가
zh_hans: 顶级编程专家
